{
  "language": "Language",
  "home": "Home",
  "product": "Product",
  "investor": "Investor",
  "jobs": "Jobs",
  "contact": "Contact",

  "contact__title": "We're here for you.",
  "contact__subtitle": "Get in touch with the CodeCompath Community Team.",
  "contact_name": "Name",
  "contact_name_msg": "Please, enter your name",
  "contact_mail": "Email",
  "contact_mail_msg": "Please, enter your email",
  "contact_phone": "Phone",
  "contact_phone_msg": "Please, enter your phone number",
  "contact_description": "Type your message here...",
  "contact_description_msg": "Please, enter your message",
  "contact_submit": "Send message",

  "jobs__title": "Looking for team members",
  "jobs__subtitle1": "Hiring",
  "jobs__subtitle2": "Tester",
  "jobs__text1": "Looking for a chance to contribute to an effective software solution:",
  "jobs__text2": "Willing to apply skills, experience and knowledge together with the test-design abilities. Using the testing technologies and tools to get the outcome. Ready to learn the aspects of a solution that is based on unique principles, test the API, UI and help with assuring the quality of the solution for all the stakeholders. Qualifications:",
  "jobs__text3": "Working in a software team",
  "jobs__text4": "Experience testing APIs, layouts and visualizations",
  "jobs__text5": "contribute",

  "investor__title": "Invest into SaaS Tech",
  "investor__window_text": "We are now open to talk with investors. If interested, please do not hesitate.",
  "investor__window_btn": "Contact us",
  "investor__facts_title": "Some facts",
  "investor__facts_ul1": "Unique product in the market",
  "investor__facts_ul2": "Can be easily implemented on top of existing tools",
  "investor__facts_ul3": "Works with teams of any scale",
  "investor__facts_ul4": "Gives a fast visual overview",
  "investor__facts_ul5": "Supports the management in unrepresented way",
  "investor__facts_ul6": "Improves efficiency",
  "investor__facts_ul7": "Brings more stability and satisfaction to team members",
  "investor__facts_ul8": "Based on a modern, flexible SaaS platform",
  "investor__facts_ul9": "Published in a Whitepaper (who is interested in the Whitepaper, can email us)",
  "investor__facts_ul10": "Built by an experienced team",
  "investor__facts_ol1": "SaaS has many advantages for fast changing companies and their teams",
  "investor__facts_ol2": "The flexibility deploys to the needs of many fast changing tasks in companies",
  "investor__facts_ol3": "Innovations come faster to the market for a wider target group",

  "product__title_1": "The floating timescale principle",
  "product__text1_1": "Software development decisions are not always quick. It is closely similar to any activity that depends on creativity, innovation and problem-solving. Decision making approaches have an effect on contributors' coordination and the resulting quality. Arguably, the effective solutions emerge when the conditions of a certain environment and timings are met. Forcing those conditions upon contributors via fixed timelines and roadmaps often results in overcommitting and risks triggering. This, in turn, leads to the degradation of ability to contribute, as well as to the degradation of quality.",
  "product__text2_1": "Traditional project management approaches based on firmly established milestones (especially far ahead in the future) have been found often creating conditions that affect ability to come up with results having certain quality or even work in accordance to the important requirements. Recent developments of project management practices, such as Agile methodologies, happened with the goal to minimize the effects that strict planning has. But it turned out to be not totally devoid of aspects that could be optimized. Even though Agile practices relax the requirements to deliver at strictly certain times, they still require contributors to be productive, engaged and motivated most of the time to be able to deliver results with the certain pace. But, as it turns out, that is not always possible. Sometimes there appear to be conditions that prevent contributors from running a development marathon with the intensity that matches processes. Even more, imagine the key contributor (or most, if not all, contributors) for some (or multitude of different) reasons stop doing contributions! Not a totally impossible turn of events. Though many would argue that chances are low, it is better to be prepared, especially when the number of signs leading to that is growing.",
  "product__text3_1": "There is a solution for such kinds of situations - a floating timescale. It has been envisioned as an alternative to the fixed timescale that the Agile and earlier approaches are based on. Often deliveries happen according to the planned schedule. But sometimes it does not happen because of the unexpected obstacles. Using the floating timescale means that nobody and nothing is forcing contributors to perform faster than the conditions allow. At the same time, it gives room to the contributors to outperform by delivering faster when the right circumstances are met. It might be surprising how effective contributors and quality of their results can be when they are given the chance to be free from the pressure of deadlines and from the requirements to be predominantly productive, engaged and motivated. Ability to continue to create, innovate and find solutions in a world that is tightly dependent on these kinds of activities often requires long breaks, periods of inactivity and the time to reflect on what is behind to learn and adapt to the challenges that are ahead. Floating timescale is there to support creators, innovators and problem-solvers in that by laying the foundation for designing the environment that is based on the principles of fostering their ability to contribute even at the times when the contribution does not seem like a real possibility.",
  "product__title_2": "Version Control on a New Level",
  "product__text1_2": "Have you ever been involved in software development? So most likely you made your experiences with version control systems (VCSs). This means you know how flexible and handy they are in terms of keeping track of what is going on in software projects.",
  "product__text2_2": "But those existing tools lack a visual tool to display dependencies between software artifacts. CodeCompath brings structure and control to manage projects of any scale and have a better real time overview of development stages. It uses unique principles, that allow to bring structure into version control. It gives a higher control and better visibility of software projects. Milestones can be achieved more precisely. Software development projects can be managed more efficiently and smoothly.",
  "product__text3_2": "CodeCompath adds a helping tool to existing version control systems (VCSs). It has been built out of own experiences for teams of any scale. It visualizes essential relationships between versions and solutions that appear during creative, innovative and problem-solving activities, which drive software development. It gives a fast and optimal overview of development stages at anytime.",
  "product__title_3": "Features",
  "product__cardtitle1_3": "1. Visualization",
  "product__cardtext1_3": "Visualization of software entities that are part of the source code repository",
  "product__cardtitle2_3": "2. Guidance",
  "product__cardtext2_3": "Guidance throughout software entities lifecycle",
  "product__cardtitle3_3": "3. Structuring",
  "product__cardtext3_3": "Source code repository structuring",
  "product__cardtitle4_3": "4. SaaS",
  "product__cardtext4_3": "SaaS solution",
  "product__title_4": "USP",
  "product__text_4": "CodeCompath offers a unique model for evolution of problem solving. This tool presents and visualizes the essential relationships between versions that appear during problem solving activities. CodeCompath makes it easier to understand, define and represent the essential aspects of problem solving activities, especially for iterative approaches. In order to help with getting to a point of a working solution, CodeCompath is focused on educating stakeholders about relevant elements of the CodeCompath model to enable advanced problem solving. Also, CodeCompath is augmenting existing tools with the new functionality that guides stakeholders to a working solution.",
  "product__cardtitle1_4": "Visualization",
  "product__cardtext1_4": "Visualizes essential relationships between versions",
  "product__cardtitle2_4": "Overview",
  "product__cardtext2_4": "Gives a fast overview about complex relations on a new level",
  "product__cardtitle3_4": "Fast Answers",
  "product__cardtext3_4": "It makes it easier to understand, define and simulate aspects of problem solving",
  "product__cardtitle4_4": "Implementation",
  "product__cardtext4_4": "CodeCompath is augmenting existing tools with the new functionality that guides to a working solution",

  "home__title": "Interview with the Founder",
  "home__subtitle_green": "'CodeCompath visually displays the status of each deliverable'.",
  "home__subtitle_white": "Projects can be managed smoother and with higher precision",
  "home__interview_title": "Interview with Sergii - Founder of CodeCompath LLC",
  "home__interview_ask1": "What is your background?",
  "home__interview_answer1": "I'm a Software Engineer. After completing my Masters degree in Computer Science, I spent 12 years working on different IT projects in Ukraine and abroad. I worked in the fields of Web Development, IT education and Research. I was managing software solutions deployed and serving internationally at a large scale, which brought me to the idea to build CodeCompath.",
  "home__interview_ask2": "What made you having that idea?",
  "home__interview_answer2": "I wanted a tool for my teams, a tool that can be used to deliver projects with a higher efficiency, visibility and quality. Based on my Master’s thesis and out of many experiences later, it became obvious what kind of tool is missing.",
  "home__interview_ask3": "What is the target group?",
  "home__interview_answer3": "Anyone who leads a large software project in enterprises of any size.",
  "home__interview_ask4": "What is the idea of CodeCompath?",
  "home__interview_answer4": "CodeCompath is a visual tool that uses custom streamline graphs. First, it visually displays deliverables on a meta-level. Deliverables are the results of development efforts that can be executed by a computer. Second, it guides people towards the most effective way to manage them. Third, it gives a structure to source code repositories.",
  "home__interview_ask5": "For what is it useful?",
  "home__interview_answer5": "CodeCompath is expected to reduce the complexity of software projects. It brings clarity into those unique relationships that exist between software entities. Modern software projects are complex. This complexity is attempted to be tackled by many existing tools and approaches, but none of them focus on unique relationships between software entities, that are usually a part of version control repositories.  ",
  "home__interview_ask6": "What are the key features?",
  "home__interview_answer6_1": "The key features are:",
  "home__interview_answer6_2": "Visualization of software entities that are a part of the source code repository managed by CodeCompath, Guidance throughout software entities lifecycle, Source code repository structuring functionality, SaaS solution",
  "home__interview_ask7": "What are the advantages for the users?",
  "home__interview_answer7": "CodeCompath gives a meta view about the status of their software development and makes them understand complex relationships between entities much faster and better. It is an easy and effective SaaS solution.  ",
  "home__interview_ask8": "What are the advantages for the users?",
  "home__interview_answer8": "CodeCompath visualizes software repositories in a sophisticated way. Services of such companies as GitHub, GitLab, Atlassian (BitBucket) are offering some basic functionalities. Those tools miss some important principles that lay in the nature of relationships between software entities. Those principles are leveraged by CodeCompath which makes it a really unique tool. ",
  "home__interview_ask9": "When will it be released?",
  "home__interview_answer9": "Core functionality of CodeCompath has been implemented and is available for demo use. We are providing a demo access per request for the interested individuals or representatives of organizations. In order to submit a request for a demo, use this form.",
  "home__interview_ask10": "What do you need at the moment?",
  "home__interview_answer10": "We need feedback about CodeCompath from the potential users and organizations looking to improve software development management practices. Also we are looking for an investor. If you are interested or know an individual/organization that might be, take a look at this page.",
  "home__interview_text": "The Q&A interview was held by Alex who is responsible for Business Development & Marketing.",
  "home__interview_date": "April 2022"
}